## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:57" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:57" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [] -> null
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "AUDIT_CONTROL",
                              + "AUDIT_WRITE",
                              + "BLOCK_SUSPEND",
                              + "CHOWN",
                              + "DAC_OVERRIDE",
                              + "DAC_READ_SEARCH",
                              + "FOWNER",
                              + "FSETID",
                              + "IPC_LOCK",
                              + "IPC_OWNER",
                              + "KILL",
                              + "LEASE",
                              + "LINUX_IMMUTABLE",
                              + "MAC_ADMIN",
                              + "MAC_OVERRIDE",
                              + "MKNOD",
                              + "NET_ADMIN",
                              + "NET_BROADCAST",
                              + "NET_RAW",
                              + "SETFCAP",
                              + "SETGID",
                              + "SETPCAP",
                              + "SETUID",
                              + "SYS_ADMIN",
                              + "SYS_BOOT",
                              + "SYS_CHROOT",
                              + "SYS_MODULE",
                              + "SYS_NICE",
                              + "SYS_PACCT",
                              + "SYS_PTRACE",
                              + "SYS_RAWIO",
                              + "SYS_RESOURCE",
                              + "SYS_TIME",
                              + "SYS_TTY_CONFIG",
                              + "SYSLOG",
                              + "WAKE_ALARM",
                            ]
                        }
                    }
                  - mountPoints      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - cpu              = 0 -> null
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "AUDIT_CONTROL",
                              + "AUDIT_WRITE",
                              + "BLOCK_SUSPEND",
                              + "CHOWN",
                              + "DAC_OVERRIDE",
                              + "DAC_READ_SEARCH",
                              + "FOWNER",
                              + "FSETID",
                              + "IPC_LOCK",
                              + "IPC_OWNER",
                              + "KILL",
                              + "LEASE",
                              + "LINUX_IMMUTABLE",
                              + "MAC_ADMIN",
                              + "MAC_OVERRIDE",
                              + "MKNOD",
                              + "NET_ADMIN",
                              + "NET_BROADCAST",
                              + "NET_RAW",
                              + "SETFCAP",
                              + "SETGID",
                              + "SETPCAP",
                              + "SETUID",
                              + "SYS_ADMIN",
                              + "SYS_BOOT",
                              + "SYS_CHROOT",
                              + "SYS_MODULE",
                              + "SYS_NICE",
                              + "SYS_PACCT",
                              + "SYS_PTRACE",
                              + "SYS_RAWIO",
                              + "SYS_RESOURCE",
                              + "SYS_TIME",
                              + "SYS_TTY_CONFIG",
                              + "SYSLOG",
                              + "WAKE_ALARM",
                            ]
                        }
                    }
                  - mountPoints      = [] -> null
                  - volumesFrom      = [] -> null
                    # (7 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 57 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>